#include <stdio.h>

void morse(char);

char korean[26] = { 'ㄱ','ㄴ','ㄷ','ㄹ','ㅁ','ㅂ','ㅅ','ㅇ','ㅈ','ㅊ','ㅋ','ㅌ','ㅍ','ㅎ','ㅏ',
				'ㅑ','ㅓ','ㅕ','ㅗ','ㅛ','ㅜ','ㅠ','ㅡ','ㅣ','ㅐ','ㅔ' };

char mor[26] = { '.-..','..-.','-...','...-','--','.--','--.','-.-','.--.','-.-.','-..-','--..',
				'---','.---','.','..','-','...','.-','-.','....','.-.','-..','..-',
				'--.-','-.--' };

int main()
{
	char scan;

	printf("한글 중 모음 혹은 자음을 입력하시오\n: ");
	scanf_s("%c", &scan);
	morse(scan);
	printf("프로그램을 종료합니다.\n");

	return 0;
}

void morse(char scan)
{
	for (int i = 0; i < 26; i++) {
		if (scan == korean[i]) {
			printf("%c 의 모르스 부호 : %c \n", scan, mor[i]);
		}
	}
}